In [1]:
import numpy as np
import pandas as pd

In [2]:
sozluk1= {"isim":["ahmet","mehmet","zeynep","atıl"],
          "spor":["koşu","yuzme","basketbal","koşu"],
         "kalori":[100,200,400,300]}

In [3]:
df1 =pd.DataFrame(sozluk1, index=[0,1,2,3])

In [4]:
df1

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yuzme     200
2  zeynep  basketbal     400
3    atıl       koşu     300

In [5]:
sozluk2= {"isim":["esma","esra","eda","nisa"],
          "spor":["koşu","yuzme","basketbal","koşu"],
         "kalori":[200,400,400,500]}

In [7]:
df2=pd.DataFrame(sozluk2, index=[4,5,6,7])

In [8]:
sozluk3= {"isim":["fatma","ilkay","ipek","mert"],
          "spor":["koşu","yuzme","badminton","tenis"],
         "kalori":[150,600,700,900]}

In [9]:
df3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [10]:
df1

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yuzme     200
2  zeynep  basketbal     400
3    atıl       koşu     300

In [11]:
df2

   isim       spor  kalori
4  esma       koşu     200
5  esra      yuzme     400
6   eda  basketbal     400
7  nisa       koşu     500

In [12]:
df3

     isim       spor  kalori
8   fatma       koşu     150
9   ilkay      yuzme     600
10   ipek  badminton     700
11   mert      tenis     900

## concatenation

In [13]:
pd.concat([df1,df2,df3])

      isim       spor  kalori
0    ahmet       koşu     100
1   mehmet      yuzme     200
2   zeynep  basketbal     400
3     atıl       koşu     300
4     esma       koşu     200
5     esra      yuzme     400
6      eda  basketbal     400
7     nisa       koşu     500
8    fatma       koşu     150
9    ilkay      yuzme     600
10    ipek  badminton     700
11    mert      tenis     900

In [14]:
pd.concat([df1,df2,df3],axis=1)

,isim,spor,kalori,isim,spor,kalori,isim,spor,kalori
0,ahmet,koşu,100.0,NaN,NaN,NaN,NaN,NaN,NaN
1,mehmet,yuzme,200.0,NaN,NaN,NaN,NaN,NaN,NaN
2,zeynep,basketbal,400.0,NaN,NaN,NaN,NaN,NaN,NaN
3,atıl,koşu,300.0,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,esma,koşu,200.0,NaN,NaN,NaN
5,NaN,NaN,NaN,esra,yuzme,400.0,NaN,NaN,NaN
6,NaN,NaN,NaN,eda,basketbal,400.0,NaN,NaN,NaN
7,NaN,NaN,NaN,nisa,koşu,500.0,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,fatma,koşu,150.0
9,NaN,NaN,NaN,NaN,NaN,NaN,ilkay,yuzme,600.0
10,NaN,NaN,NaN,NaN,NaN,NaN,ipek,badminton,700.0
11,NaN,NaN,NaN,NaN,NaN,NaN,mert,tenis,900.0

## merge

In [15]:
mSozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
         "spor":["kosu","yuzme","kosu","basketbol"]}

In [16]:
mDf=pd.DataFrame(mSozluk1)

In [17]:
mDf

     isim       spor
0   ahmet       kosu
1  mehmet      yuzme
2  zeynep       kosu
3    atıl  basketbol

In [18]:
mSozluk2={"isim":["ahmet","mehmet","zeynep","atıl"],
         "kalori":[100,200,300,500]}

In [19]:
mDf2=pd.DataFrame(mSozluk2)

In [20]:
mDf2

     isim  kalori
0   ahmet     100
1  mehmet     200
2  zeynep     300
3    atıl     500

In [21]:
pd.merge(mDf,mDf2,on="isim")

     isim       spor  kalori
0   ahmet       kosu     100
1  mehmet      yuzme     200
2  zeynep       kosu     300
3    atıl  basketbol     500

In [22]:
maasSozluk={"ısım":["esra","esma","eda","nisa"],
           "departman":["yazılım","satıs","pazarlama","yazılım"],
           "maas":[2000,3000,4000,5000]}

In [23]:
mDf=pd.DataFrame(maasSozluk)

In [24]:
mDf

   ısım  departman  maas
0  esra    yazılım  2000
1  esma      satıs  3000
2   eda  pazarlama  4000
3  nisa    yazılım  5000

In [26]:
mDf["departman"].unique()

array(['yazılım', 'satıs', 'pazarlama'], dtype=object)

In [27]:
mDf["departman"].nunique()

3

In [28]:
mDf["departman"].value_counts()

yazılım      2
satıs        1
pazarlama    1
Name: departman, dtype: int64

In [32]:
def brutnet(maas):
    return maas*0.66

In [33]:
mDf["maas"].apply(brutnet)

0    1320.0
1    1980.0
2    2640.0
3    3300.0
Name: maas, dtype: float64

In [34]:
mDf.isnull()

    ısım  departman   maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [35]:
yeniVeri={"karakter sınıfı":["south park","south park","simpson","simpson"],
         "karakter ısmı":["cartmen","kenny","homer","bart"],
         "karakter yas":[9,10,50,20]}

In [36]:
kDf=pd.DataFrame(yeniVeri)

In [38]:
kDf

  karakter sınıfı karakter ısmı  karakter yas
0      south park       cartmen             9
1      south park         kenny            10
2         simpson         homer            50
3         simpson          bart            20

In [40]:
kDf.pivot_table(values="karakter yas", index=["karakter sınıfı","karakter ısmı"])

                               karakter yas
karakter sınıfı karakter ısmı
simpson         bart                     20
                homer                    50
south park      cartmen                   9
                kenny                    10